results_595/sglang/glm-5.1/1k4k/logs/GLM-5.1-NVFP4_nvfp4_sglang_tp8_conc512_1k4k.log
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/GLM-5.1-NVFP4', served_model_name=None, tokenizer=None, num_prompts=5120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=4096, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=512, output_file='/results/sglang/glm-5.1/1k4k/json/GLM-5.1-NVFP4_nvfp4_sglang_tp8_conc512_1k4k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/GLM-5.1-NVFP4', served_model_name=None, tokenizer=None, num_prompts=5120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=4096, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=512, output_file='/results/sglang/glm-5.1/1k4k/json/GLM-5.1-NVFP4_nvfp4_sglang_tp8_conc512_1k4k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 5242880
#Output tokens: 20971520
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 5120/5120 [48:56<00:00,  1.74it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 512       
Successful requests:                     5120      
Benchmark duration (s):                  2936.48   
Total input tokens:                      5242880   
Total input text tokens:                 5242880   
Total generated tokens:                  20971520  
Total generated tokens (retokenized):    20953433  
Request throughput (req/s):              1.74      
Input token throughput (tok/s):          1785.43   
Output token throughput (tok/s):         7141.73   
Peak output token throughput (tok/s):    15872.00  
Peak concurrent requests:                1024      
Total token throughput (tok/s):          8927.16   
Concurrency:                             511.59    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   293411.69 
Median E2E Latency (ms):                 293986.05 
P90 E2E Latency (ms):                    295617.00 
P99 E2E Latency (ms):                    296020.40 
---------------Time to First Token----------------
Mean TTFT (ms):                          6805.91   
Median TTFT (ms):                        6894.26   
P99 TTFT (ms):                           11733.86  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.99     
Median TPOT (ms):                        69.99     
P99 TPOT (ms):                           71.51     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           70.19     
Median ITL (ms):                         60.28     
P95 ITL (ms):                            111.22    
P99 ITL (ms):                            383.43    
Max ITL (ms):                            10283.23  
==================================================